def area(a, b):
    '''
    возвращает площадь прямоугольника

        Параметры: 
            a (int) : целое положительное число(ширина квадрата)
            b (int) : целое положительное число(длина квадрата)

        возвращаемое значение: area (int) : целое положительное число(площадь прямоугольника)
    '''
    return a * b

def perimeter(a, b):
    '''
    возвращает периметр прямоугольника

        Параметры: 
            a (int) : целое положительное число(ширина квадрата)
            b (int) : целое положительное число(длина квадрата)

        возвращаемое значение: perimeter (int) : целое положительное число(периметр прямоугольника)
    '''
    return (a + b) * 2
