def area(a, b):
    '''
        возвращает площадь прямоугольника
    
            Параметры: 
                a (int) : положительное число(ширина квадрата)
                b (int) : положительное число(длина квадрата)

            возвращаемое значение: area (int) : положительное число(площадь прямоугольника)
    '''
    return a * b

def perimeter(a, b):
    '''
            возвращает периметр прямоугольника
        
                Параметры: 
                    a (int) : положительное число(ширина квадрата)
                    b (int) : положительное число(длина квадрата)
    
                возвращаемое значение: area (int) : положительное число(периметр прямоугольника)
        '''
    return (a + b) * 2
